# SourceFileDrivenByOtherTarget Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LinkFailures..::..SourceFileDrivenByOtherTarget Property
BuiltInFailures..::..LinkFailures Class See Also
---
Linked Model's Shared Coordinates have been modified via another host model in this session. In order to be able to change the Linked File via the active host model, Save and open it again in a new session.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SourceFileDrivenByOtherTarget { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SourceFileDrivenByOtherTarget As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SourceFileDrivenByOtherTarget {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..LinkFailures Class
Autodesk.Revit.DB Namespace